README.md
```mermaid
graph BT
    style PurePath fill:#ffffff,stroke:#000000,color:#000000;
    style PureGCSPath fill:#add8e6,stroke:#000000,color:#000000;
    style PurePosixPath fill:#ffffff,stroke:#a9a9a9,color:#a9a9a9;
    style PureWindowsPath fill:#ffffff,stroke:#a9a9a9,color:#a9a9a9;
    style Path fill:#ffffff,stroke:#a9a9a9,color:#a9a9a9;
    style PosixPath fill:#ffffff,stroke:#a9a9a9,color:#a9a9a9;
    style WindowsPath fill:#ffffff,stroke:#a9a9a9,color:#a9a9a9;

    PurePath["PurePath"]
    PurePosixPath["PurePosixPath"]
    PureWindowsPath["PureWindowsPath"]
    PureGCSPath["PureGCSPath"]
    Path["Path"]
    PosixPath["PosixPath"]
    WindowsPath["WindowsPath"]

    PurePosixPath-->PurePath
    PureWindowsPath-->PurePath
    PureGCSPath-->PurePath
    Path-->PurePath
    PosixPath-->PurePosixPath
    PosixPath-->Path
    WindowsPath-->PureWindowsPath
    WindowsPath-->Path
```
